print("Перезагрузите компьютер и попробуйте подключиться")

user_input = input("Вы исправили проблему?: ")
if user_input == 'нет':
    print("Перезагрузите маршрутизатор и попробуйте подключиться.")

user_input = input("Вы исправили проблему? ")
if user_input == "да":
    print("Обратите внимание, что программа завершается, как только решение проблемы найдено.")

print("Перезагрузите компьютер и попробуйте подключиться.")

user_input = input("Вы исправили проблему? ")
if user_input == "нет":
    print("Перезагрузите маршрутизатор и попробуйте подключиться.")
else:
    print("Возьмите новый маршрутизатор.")
user_input = input("Вы исправили проблему? ")
if user_input == "нет":
    print("Убедитесь, что кабели между маршрутизатором и модемом прочно подсоединены.")
else:
    print("Возьмите новый маршрутизатор.")
user_input = input("Вы исправили проблему? ")
if user_input == "нет":
    print("Переместите маршрутизатор на новое место.")
else:
    print("Возьмите новый маршрутизатор.")
user_input = input("Вы исправили проблему? ")
if user_input == "нет":
    print("Возьмите новый маршрутизатор.")
